senserf/picos/PicOS/CC13XX/TENTATIVE/rfprop_nowor.c
	entry (DR_FRCE)

		// Transmit without LBT
		RF_cmdPropTx . status = 0;
		issue_cmd ((lword)&RF_cmdPropTx);

	entry (DR_FXMT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		wait (txevent, DR_FXMT);
		enable_event (txevent);
		if ((RF_cmdPropTx.status & 0x3000) != 0x3000)
			// Wait for command completion
			release;

		// Check the CS status
		if (RF_cmdPropTx.status == PROP_DONE_OK)
			goto TXEnd;

		// Something wrong
		delay (1, DR_LOOP);
		release;

#else	/* RADIO_LBT_SENSE_TIME */

// ============================================================================
// LBT OFF ====================================================================
// ============================================================================

		RF_cmdPropTx . status = 0;
		issue_cmd ((lword)&RF_cmdPropTx);

	entry (DR_XMIT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		wait (txevent, DR_XMIT);
		enable_event (txevent);
		if ((RF_cmdPropTx.status & 0x3000) != 0x3000)
			// Wait for command completion
			release;

		// Check the CS status
		if (RF_cmdPropTx.status != PROP_DONE_OK) {
			// Something wrong
			delay (1, DR_LOOP);
			release;
		}

		// Release the packet
		tcvphy_end ((address)the_packet);
		paylen = 0;

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		bckf_lbt = 0;
#endif

#if RADIO_LBT_SENSE_TIME > 0
		txtries = 0;
#endif
		LEDI (1, 0);
		gbackoff_xmt;
		goto DR_LOOP__;

#endif	/* RADIO_LBT_SENSE_TIME */

// ============================================================================
// END LBT ====================================================================
// ============================================================================




TOFF....
	entry (DR_GOOF)

		// Inactivity timeout with RX OFF
		if (!(dstate & DSTATE_IRST) && (dstate & DSTATE_RXON) == 0 &&
		    tcvphy_top (physid) == NULL)
			rf_off ();

		goto DR_LOOP__;
endthread

#undef	the_packet
#undef	the_packet_length

#undef	DR_LOOP
#undef	DR_XMIT
#undef	DR_FRCE
#undef	DR_FXMT
#undef	DR_GOOF
#undef	DR_WRES
#undef	DR_WURG
#undef	DR_WXMT

// ============================================================================

static void init_rbuffs () {
//
// Set up the receive buffer pool (called once upon startup)
//
	int i;
	rfc_dataEntryGeneral_t *re, *da, *db;

	i = 0;
	while (1) {
		db = (rfc_dataEntryGeneral_t*)
			umalloc (sizeof (rfc_dataEntryGeneral_t) - 1 + rbuffl +
				2);
			// 2 extra bytes needed on top of two extra bytes
			// from mbs; at this stage rbuffl = max paylen + 2
#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
		if (db == NULL)
			syserror (EMALLOC, "cc13");
#endif
		db->status = DATA_ENTRY_PENDING;

		if (i)
			// Link to previous
			da->pNextEntry = (byte*) db;
		else
			re = db;

		db->config.type = 0;	// General (data in structure)
		db->config.lenSz = 1;	// Single byte for length
		db->config.irqIntv = 0;	// Irrelevant
		db->length = rbuffl + 2;
		if (++i == NRBUFFS)
			break;
		da = db;
	}

	// Link last to first
	db->pNextEntry = (byte*) re;

	// This is an alias for RF_cmdPropRx.pQueue
	rbuffs = (dataQueue_t*) umalloc (sizeof (dataQueue_t));
		
#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (rbuffs == NULL)
		syserror (EMALLOC, "cc13");
#endif
	rbuffs->pCurrEntry = (byte*) re;
	rbuffs->pLastEntry = NULL;

	// Prepare the command to start reading
	RF_cmdPropRx . pOutput = (byte*) &rxstat;

	// I guess this is how we make sure the command runs in a loop
	RF_cmdPropRx . pktConf . bRepeatOk = 1;
	RF_cmdPropRx . pktConf . bRepeatNok = 1;

	// Auto-discard rejects from the queue
	RF_cmdPropRx . rxConf . bAutoFlushIgnored = 1;
	RF_cmdPropRx . rxConf . bAutoFlushCrcErr = 1;

	// RSSI appended to the received packet; also, by default, the CRC
	// is discarded and a status byte is appended
	RF_cmdPropRx . rxConf . bAppendRssi = 1;

	// Make rbuffl exactly equal to max payload length
	rbuffl -= 2;
}

static void set_driver_params (cc1350_rfparams_t *pt) {

	if (pt) {
		// From the table
		memcpy (&params, pt, sizeof (cc1350_rfparams_t));
	} else {
		// The defaults
		params . offdelay = RADIO_DEFAULT_OFFDELAY;
	}
}

static int option (int opt, address val) {

	int ret = 0;

	switch (opt) {

		case PHYSOPT_STATUS:

			ret = 2 | ((dstate & DSTATE_RXON) != 0);
			goto RVal;

		case PHYSOPT_RXON:

			_BIS (dstate, DSTATE_RXON);
OREvnt:
			p_trigger (drvprcs, qevent);

		case PHYSOPT_TXON:
		case PHYSOPT_TXOFF:
		case PHYSOPT_TXHOLD:

			goto RRet;

		case PHYSOPT_RXOFF:

			_BIC (dstate, DSTATE_RXON);
			// Include reset
			goto ORst;

		case PHYSOPT_SETSID:

			statid = (val == NULL) ? 0 : *val;
			goto RRet;

		case PHYSOPT_GETSID:

			ret = (int) statid;
			goto RVal;

		case PHYSOPT_GETMAXPL:

			ret = rbuffl + 2;
			goto RVal;

	    	case PHYSOPT_ERROR:

			if (val != NULL) {
				memcpy (val, &rxstat,
					sizeof (rfc_propRxOutput_t));
			} else {
				memset (&rxstat, 0, 
					sizeof (rfc_propRxOutput_t));
			}

			goto RRet;

		case PHYSOPT_CAV:

			if (val == NULL)
				// Random LBT backoff
				gbackoff_lbt;
			else
				utimer_set (bckf_timer, *val);

			goto OREvnt;

		case PHYSOPT_GETPOWER:

#if RADIO_DEFAULT_POWER <= 7
			ret = txpower;
#else
			ret = RADIO_DEFAULT_POWER;
#endif
			goto RVal;

		case PHYSOPT_RESET:

#if RADIO_DEFAULT_POWER <= 7
			// Replace the patable
			patable = (val == NULL) ? patable_def : val;
Reset_pwr:
			RF_cmdPropRadioDivSetup.txPower = patable [txpower];
#endif
			goto ORst;

#if RADIO_DEFAULT_POWER <= 7 && (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS) == 0
		// Can be set
		case PHYSOPT_SETPOWER:

			// This goes via a global reset; apparently, we can do
			// per-packet power via a special command; the global
			// reset makes sense for a casual SETPOWER, because we
			// can execute it sensibly regardless of the RF state

			ret = txpower = (val == NULL) ? RADIO_DEFAULT_POWER :
				(*val > 7) ? 7 : *val;
			goto Reset_pwr;
#endif
		case PHYSOPT_GETCHANNEL:

			ret = (int) channel;
			goto RVal;

		case PHYSOPT_SETCHANNEL:

			channel = (val == NULL) ? RADIO_DEFAULT_CHANNEL :
				(*val > 7) ? 7 : *val;
			plugch ();
ORst:
			_BIS (dstate, DSTATE_IRST);
			goto OREvnt;

		case PHYSOPT_GETRATE:

			ret = (int) vrate;
			goto RVal;

#if RADIO_BITRATE_INDEX > 0

		case PHYSOPT_SETRATE:

			vrate = (val == NULL) ? RADIO_BITRATE_INDEX :
				(*val >= NRATES) ? NRATES - 1 :
					(*val < 1) ? 1 : *val;
			plugrt ();
			goto ORst;
#endif
		case PHYSOPT_SETPARAMS:

			set_driver_params ((cc1350_rfparams_t*) val);
			goto ORst;

#if TARP_COMPRESS
	    	// I make this conditional on a TARP parameter, although the
	    	// feature is potentially generally useful
	    	case PHYSOPT_REVOKE:

			ret = 0;
			if (paylen != 0 && (dstate & DSTATE_TXIP) == 0) {
				// Check the currently pending packet, if not
				// locked
				if (((pktqual_t)val)
					((address)RF_cmdPropTx.pPkt)) {
					// Delete current
					tcvphy_end ((address)
						RF_cmdPropTx.pPkt);
					paylen = 0;
					ret++;
				}
			}

			// Now try the queued packets
			ret += tcvphy_erase (physid, (pktqual_t)val);
			break;
#endif
		default:

			syserror (EREQPAR, "cc13 op");
	}
RRet:
	return ret;
RVal:
	if (val != NULL)
		*val = ret;
	goto RRet;
}

// ============================================================================

void phys_cc1350 (int phy, int mbs) {
//
// For combatibility with cc1100, mbs does cover the checksum (or status
// bytes), so it is equal to max payload length + 2. Not sure what the maximum
// packet length is (and I have reasons not to trust the manual), so let me
// assume it is 255 - 4 - 1 = 250. We shall be careful.
//
	TIME_COLDSTART;

